"""
2) Создайте словарь d = {'1': 0, ‘2’: 0, '3': 0} тремя способами.
 Выведите полученный словарь на экран.
"""

dict1 = dict.fromkeys(['1', '2', '3'], 0)
print(dict1)
dict2 = dict([('1', 0), ('2', 0), ('3', 0)])
print(dict2)
dict3 = {i: 0 for i in ('1', '2', '3')}
print(dict3)
