"""
3) Задан список слов, в которых встречается символ ‘_’ подчеркивание).

Создать новый список, в котором символ подчеркивания в словах ‘_’ заменить символом ‘ ‘ (пробел).
 l = [ "ab_cd_e", "abc", "a_b_c", "a__bc_d_", "__" ]
"""
a = ["ab_cd_e", "abc", "a_b_c", "a__bc_d_", "__"]
s = ','.join(a)
new_s = s.replace("_", " ")
new_lst = [i for i in new_s.split(',')]
print(new_lst)
