# 1 Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.
a = 3
b = 2
result1 = a + b
result2 = a - b
result3 = a * b
print(result1, 'Сумма чисел')
print(result2, 'Разность чисел')
print(result3, 'Произведение чисел')
