# 3. Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.
a = 3  # длина ребра куба
V = 3 ** 3
S = 4 * (3 ** 2)
print(V, 'Объём куба')
print(S, 'Площадь боковой поверности куба')
