# 2. Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел.
import math
a = int(3)
b = int(2)
result1 = (a + b)/2
result2 = (math.sqrt(3 * 2))
print(result1, 'Среднее арифмитическое')
print(result2, 'Среднее геометрическое')
