"""
9.	Дан список [student1, student2, student3] с помощью цикла for
 добавить к каждому элементу списка слово “_good”. Вывести на экран.
"""
lst = ['student1', 'student2', 'student3']
string = '_good'
for i in lst:
    if i == 'student1':
        print(i + string)
    elif i == 'student2':
        print(i + string)
    else:
        print(i + string)