"""
7.	Создать список с числами от 1 до 50 используя генератор списков.
"""
lst = [i for i in range(1, 51)]
print(lst)
